# System tools
brew 'grep'

# Development & Power Tools
cask 'iterm2'
cask 'visual-studio-code'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'jq'
brew 'jiq'
brew 'node'
brew 'protobuf'
brew 'watchman'
brew 'yarn'
brew 'go'
brew 'gh'
brew 'git'

# Containers
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'kubectx'
cask 'minikube'
brew 'skaffold'
cask 'docker' # docker for desktop

# Desktop Software
cask 'zoomus'
cask 'slack'
cask 'google-chrome'