# System tools
brew 'grep'
brew 'jq'
brew 'gnu-time'

# Golang
brew 'go'
brew "mockery"
brew "golangci-lint"

# NodeJS
brew 'node'
brew 'yarn'
brew "nvm"

# Development & Tools
brew 'protobuf'
brew 'watchman'
brew 'git'
brew 'protobuf'
brew "terraform"
brew "telnet"

brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
tap "homebrew/cask-fonts"
cask "font-fira-code"

# Containers
cask 'docker' 
brew "minikube"
brew "k9s"
brew "kubectx"
brew "helm"

# Desktop Software
cask 'zoomus'
cask 'slack'
cask 'google-chrome'
cask 'openinterminal'
cask "monitorcontrol"
cask "iterm2"
cask "maccy"
cask 'visual-studio-code'
cask 'calibre'