# System tools
brew "grep"
brew "jq"
brew "gnu-time"

# Golang
brew "go"
brew "mockery"
brew "golangci-lint"

# NodeJS
brew "node"
brew "yarn"
brew "nvm"

# Development & Tools
brew "protobuf"
brew "watchman"
brew "git"
brew "gh"
brew "protobuf"
brew "terraform"
brew "telnet"
brew "graphviz"

brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
tap "homebrew/cask-fonts"
cask "font-fira-code"
brew "prettier"

# Containers
cask "docker" 
brew "minikube"
brew "k9s"
brew "kubectx"
brew "helm"

# Cloud
brew "awscli"
cask "aws-vault"

# Desktop Software
cask "zoomus"
cask "slack"
cask "google-chrome"
cask "openinterminal"
cask "monitorcontrol"
cask "iterm2"
cask "maccy"
cask "visual-studio-code"
cask "calibre"
cask "raycast"
cask "fig"
cask "arc"